function demo(arr) {
    //shift взима първият елемент от масива и го маха 
    //unshift вкарва елемент в началото на масива и връща новата дължина на новият масив
    //push вкарва в края на масива стойност
    //pop взима последният елемент от масива
    //includes дали съдържа определент елемент във функцията
    //indexOf връща стойноста на идекса -1 ако го няма ,ако го има връща самото му място като индекс
    // -1 значи false
    //slice прави нов масив (копие) , като старият масив не се променя , новият започва от индекса който му подадем и стига до края ако не сме му задали краен индекс
    //splice променя съдържанието на масива като изтрива или заменя съществуващи елементи и/или добавя нови
    //map променя масива ,на всеки x може да добавя стойност и да променя масива 
    //sort сортира елементите от масива според зависи как искаме да бъдат подредени ,по числа ,или по азбучен ред
    //filter работи като взима елементи от масива и ги изкарва извън него, може и да ги изтрие посочените елементи от масива.
    //localeCompare подрежда думите в масива по азбучен ред ,не се влиае от това дали са с малки и голими букви думите
    //forEach за всеки елемент изпълнява съотвента функция ,конкатенация или console.log на самият масив
    //reduce събира всичките числа в масива автоматично и ги връща като събрана стойност (* ,/ ,+,-) 
    //join Добавя на масива празен стринг или специален знак между самите данни
    //split прави така че от стринг да се превърне във масив -пример => arr.split(' ').
}
demo([])